{"id":"blogs/entry:13274","title":"Interview: LA comedian Heather Campbell gets to join the future before you with Google Glass Explorer program (audio)","short_title":"LA comedian gets to join the future before you with Google Glass (audio)","byline":"Mike Roe","published_at":"2013-04-12T06:00:24-07:00","teaser":"Heather Campbell has an impressive resume: former “Saturday Night Live” writer, appearing on the rebooted “Whose Line Is It Anyway”… and now, a winner in the Google Glass Explorer program.","body":"<p>Los Angeles-based comedian&nbsp;Heather Anne Campbell has an impressive resume: former &ldquo;Saturday Night Live&rdquo; writer, Emmy nominated, currently writing for Fox&rsquo;s ADHD animation block, appearing on the rebooted &ldquo;Whose Line Is It Anyway&rdquo;&hellip; and now, a winner in the Google Glass Explorer program.</p>\r\n\r\n<p>In addition to being hilarious, Campbell is an early adopting self-described &ldquo;huge nerd,&rdquo; so she entered the #IfIHadGlass contest held on Twitter and Google+ to get her hands on Google&rsquo;s new wearable computer/heads up display Google Glass before anyone else.</p>\r\n\r\n<p>Google sent her notifications of her victory through Twitter and Google+, but that&rsquo;s not where she found out. Instead, she says she was reading one of the tech blogs she normally reads and saw her name. &ldquo;I was like, &lsquo;Oh no, that&rsquo;s me!&rsquo;&rdquo;</p>\r\n\r\n<p>The winning Twitter entry that Google Glass responded to:</p>\r\n\r\n<p><!-- EMBED PLACEHOLDER: https://twitter.com/KPCC/status/389899667669921792 --><a class=\"embed-placeholder\" data-service=\"twitter\" href=\"https://twitter.com/KPCC/status/389899667669921792\" title=\"Tweeter\">Tweeter</a><!-- END PLACEHOLDER --></p>\r\n\r\n<p>Campbell says her tongue-in-cheek Twitter entry shows some of the potential social problems we may face in a future where everyone can even more easily be recording you at any moment.</p>\r\n\r\n<p>&ldquo;If it takes off, there&rsquo;s gonna be a bunch of new sort of social rules written about what is and is not appropriate to do with Google Glass, sort of like, if you&rsquo;re at a romantic dinner, you don&rsquo;t put your cell phone on the table.&rdquo;</p>\r\n\r\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"304\" src=\"http://www.youtube.com/embed/v1uyQZNg2vE\" width=\"540\"></iframe></p>\r\n\r\n<p>As Campbell notes, the demo video shows people doing things like playing with their kids, but Campbell says, &ldquo;There&rsquo;s not going to be any responsibility in what I&rsquo;m going to be filming.&rdquo;</p>\r\n\r\n<p>Campbell is a frequent comedy improviser, and says she might wear Google Glass on stage during a show.</p>\r\n\r\n<p>&ldquo;I think it would be really unique for people who are interested in improv to be able to see what it&rsquo;s like to be onstage during a comedy show as opposed to just watching one.&rdquo;</p>\r\n\r\n<p>She provided some other ideas in <a href=\"https://plus.google.com/108396192710078858486/posts/LDXgwLuvVaF\">her entry on Google+</a>, writing, &ldquo;I would wear it during comedy shows to share what it&rsquo;s like to be on-stage at the MGM in Vegas. While traveling, I&rsquo;d take photos like <a href=\"http://photography.nationalgeographic.com/photography/photo-of-the-day/arno-river-bridge/\">my NatGeo Pic Of The Day</a>. Or I&rsquo;d run around making &lsquo;pew-pew-pew&rsquo; noises pretending I was a robot cop in the future.&rdquo;</p>\r\n\r\n<p>Just because she&rsquo;s been chosen for this program doesn&rsquo;t mean she gets Google Glass for free. The price tag for those in the early adopter program: $1,500. But Campbell&rsquo;s cool with that.</p>\r\n\r\n<p>&ldquo;This is a technology that can exist now, like driverless cars, and the only thing that keeps these things from existing is that people aren&rsquo;t making them happen. And I think that the Google R&amp;D division is very, very progressive, and I celebrate that and would love to encourage it with my money and participation.&rdquo;</p>\r\n\r\n<p>Still, that doesn&rsquo;t mean she hasn&rsquo;t been forced to make some cuts for this to happen.</p>\r\n\r\n<p>&ldquo;I had set aside money for a photo shoot with my friend,&rdquo; Campbell said, &ldquo;and I had to call her and be like, hey, this morning, there&rsquo;s this crazy thing that happened, and now I owe Google $1,500, so I can&rsquo;t do this photo shoot.&rdquo;</p>\r\n\r\n<p>Campbell wants to make some history of her own with Glass, planning on shooting sketch comedy videos with her group <a href=\"http://www.youtube.com/user/theucbmidnightshow\">the Midnight Show</a> and being the first group to do so.</p>\r\n\r\n<p>How practical they are in day-to-day life remains to be seen. Campbell was part of Google&rsquo;s Chromebook pilot program as well.</p>\r\n\r\n<p>&ldquo;I love getting weird stuff in the mail from Google.&rdquo;</p>\r\n\r\n<p>Still, she gave up on the Chromebook after a month due to her inability to use industry standard screenwriting and design software.</p>\r\n\r\n<p>Campbell can see some potentially useful applications for Google Glass.</p>\r\n\r\n<p>&ldquo;For people who go to these networking parties and everything, it&rsquo;s gonna be great to wear them, because somebody will develop an app that tracks people via their public Google+ profile, and you&rsquo;ll be able to say, &lsquo;Oh, this person works for that company, and that&rsquo;s something that I&rsquo;m interested in and I want to go talk to them.&rsquo;&rdquo;</p>\r\n\r\n<p>She thinks they might even be an aid to public safety.</p>\r\n\r\n<p>&ldquo;If they&rsquo;ve got GPS built into them, and you are filming wherever you go, it seems less likely that somebody would be mugged,&rdquo; Campbell said. &ldquo;Unless they&rsquo;re going to steal your glasses, but even then it&rsquo;s already streamed to your cloud device. So as a girl who leaves comedy shows late at night, I&rsquo;ll definitely wear them leaving the comedy shows.&rdquo;</p>\r\n\r\n<p>Google is casting a wide net, <a href=\"http://cs.stanford.edu/people/karpathy/glass/\">reaching out to notables</a> in its Explorer program, with celebrity participants including Neil Patrick Harris, Alyssa Milano, Kevin Smith, Newt Gingrich and more. One Explorer is even an owner of <a href=\"http://2.bp.blogspot.com/-FoIlaO8eRfU/T947kYE73dI/AAAAAAAADw4/LKcA1qAuk7A/s1600/geordi_la_forge.jpg\">a previous fictional version of a similar technology</a> &mdash; LeVar Burton, aka Geordi La Forge from &ldquo;Star Trek: The Next Generation.&rdquo;</p>\r\n\r\n<p>This isn&rsquo;t Campbell&rsquo;s first run with futuristic glasses &mdash; she says that, in college, she bought a pair of 3D virtual reality glasses for $900 to play video games, but after six months decided, &ldquo;&lsquo;This is really stupid.&rsquo; But at the same time, it was fun and exciting to pretend to live in the future that you want to live in, and with Google Glass, it&rsquo;s like, &lsquo;Oh, that&rsquo;s kind of a thing that I hope happens.&rsquo; So yeah, I&rsquo;ll early adopt and look like a nerd at parties until everybody&rsquo;s wearing them.&rdquo;</p>\r\n\r\n<p>&ldquo;Maybe a month after wearing Google Glass, I&rsquo;ll be like, &lsquo;This is the dumbest thing I&rsquo;ve ever spent money on,&rsquo;&rdquo; Campbell said.</p>\r\n\r\n<p>But for now, she&rsquo;s excited and optimistic about the technology&rsquo;s future.</p>\r\n\r\n<p>&ldquo;I hope they make robots. Man, I really want to be in Google&rsquo;s robot pilot program. &hellip; Like, walking around with a robot would be pretty great.&rdquo;</p>\r\n\r\n<p>Keep an eye out for a funny blonde woman winking at you from behind a pair of future-chic glasses in the not-too-distant future.</p>\r\n","permalink":"http://www.scpr.org/blogs/newmedia/2013/04/12/13274/interview-la-comedian-heather-campbell-gets-to-joi/","thumbnail":"<img src=\"http://a.scpr.org/i/9a5b96f6c0842148406b19aadb833200/58278-lsquare.jpg\" width=\"188\" height=\"188\" alt=\"\" />","category":{"id":10,"title":"Culture","url":"http://www.scpr.org/culture"},"assets":[{"title":null,"caption":"Los Angeles writer/comedian Heather Anne Campbell.","owner":"Dana Patrick","thumbnail":{"url":"http://a.scpr.org/i/9a5b96f6c0842148406b19aadb833200/58278-lsquare.jpg","width":188,"height":188},"small":{"url":"http://a.scpr.org/i/9a5b96f6c0842148406b19aadb833200/58278-small.jpg","width":297,"height":450},"large":{"url":"http://a.scpr.org/i/9a5b96f6c0842148406b19aadb833200/58278-eight.jpg","width":320,"height":486},"full":{"url":"http://a.scpr.org/i/9a5b96f6c0842148406b19aadb833200/58278-full.jpg","width":675,"height":1024}}],"attributions":[{"name":"Mike Roe","role_text":"Primary","role":0}]}